{
  "users": [
    {
      "name": "admin",
      "pass": "12345678",
      "id": 1
    }
  ],
  "cars": [
    {
      "id": 1,
      "carname": "Nissan Skyline R34",
      "image": "https://wallpaperaccess.com/full/1289651.jpg",
      "price": "23000",
      "description": "10 поколение Nissan Skyline было представлено в мае 1998 в кузовах R34 c большим акцентом на спортивность и соответствие новым экологическим нормам. В базовой модели GT двигатель RB20E был заменен на RB20DE, в последний раз использовавшийся на R32, но модернизированный (NEO). R34 GT с двигателем RB20DE NEO и 5-ступенчатой коробкой передач, стал лучшим по топливной экономичности среди 6-цилиндровых Skyline всех поколений. 5-ступенчатая автоматическая трансмиссия была исключена из этого поколения, взамен предлагалась 4-ступенчатая АКПП и полный привод"
    },
    {
      "id": 2,
      "carname": "Toyota Supra IV",
      "image": "https://wallpaperaccess.com/full/167416.jpg",
      "price": "53000",
      "description": "Toyota Supra- легендарное японское спортивное купе. Последнее поколение с индексом A80 покинуло конвейер в 2002 году и запомнилось своим ярким дизайном, классической компоновкой, необычным салоном, напоминающим кокпит истребителя, а самое главное- мощным мотором, отлично подходящим для дальнейших доработок. И вот, спустя 17 лет, производитель анонсировал новое поколение с индексом A90. Стоит отметить, что, по факту, автомобиль нельзя назвать полностью японской разработкой. По факту, это перекроенный немецкий родстер BMW Z4. Хоть внешний облик новой Супры и выдает ее происхождение, японские дизайнеры внесли множество уникальных черт. Передняя часть полностью отличается от исходной модели. У нее гораздо более вытянутые фары головного освещения с шестью прямоугольными секциями фокусирующих элементов. "
    },
    {
      "id": 3,
      "carname": "Mazda RX-7 FD",
      "image": "https://wallpaperaccess.com/full/1792824.jpg",
      "price": "40000",
      "description": " спортивный автомобиль, выпускавшийся японским автопроизводителем Mazda с 1978 по 2002 год. Оригинальная RX-7 оснащалась двухсекционным роторно-поршневым двигателем и имела переднюю среднемоторную, заднеприводную компоновку. RX-7 пришла на смену RX-3 (обе в Японии продавались под маркой Savanna), вытеснила все остальные роторные автомобили Mazda за исключением Cosmo. За всю историю Mazda RX-7 было три поколения. Первое поколение выпускалось с 1978 по 1985 год. Второе поколение — с 1985 по 1991. Третье поколение — с 1992 по 2002 год."
    },
    {
      "id": 4,
      "carname": "Nissan Silvia S15",
      "image": "https://wallpaperaccess.com/full/1336455.jpg",
      "price": "23000",
      "description": "Спортивное купе, выпускавшееся японским автопроизводителем Nissan с 1965 по 2002 годы. Купе строилось на платформе Nissan S. Хотя и последние модели разделяли это шасси с другими автомобилями Nissan (в первую очередь европейская 200SX и североамериканская 240SX в поколениях S13 и S14, и модель 180SX на японском рынке), название Silvia на эти автомобили совместно с кодами шасси не переходило."
    },
    {
      "id": 5,
      "carname": "Honda Acura NSX I",
      "image": "https://wallpaperaccess.com/full/1738960.jpg",
      "price": "60000",
      "description": "Японский супер-спорткар мирового уровня Honda NSX начали выпускать в 1990 году. Это было время, когда Honda переживала самые большие успехи в гонках Formula-1. Об NSX ходят слухи, что в его разработке принимал участие Айртон Сенна, трехкратный чемпион этих гонок. При серийном производстве этого автомобиля был применен кузов монолитной конструкции, выполненный полностью из алюминия. Кроме того, различные детали были сделаны из алюминиевых сплавов, за счет чего вес автомобиля составил около 1300 кг. Трехлитровый двигатель V6 DOHC VTEC, гордость Honda, расположен в середине корпуса NSX. Большая часть узлов этой машины — ручной сборки. В 1992 году появилась модификация Type R, которая до сих пор остается на волне большой популярности. С 1997 года устанавливается также двигатель объемом 3,2 л, а благодаря усовершенствованию подвески значительно улучшились ходовые характеристики автомобиля."
    },
    {
      "id": 6,
      "carname": "Mitsubishi Lancer Evo-V",
      "image": "https://wallpaperaccess.com/full/4589026.jpg",
      "price": "17000",
      "description": "спортивный вариант Mitsubishi Lancer, производившийся с 1992 по 2015 год. Выполнен в кузове седан (IX поколение выпускалось также с кузовом универсал). Внешне отличается от стандартного Lancer бампером, капотом, спойлером, расширенными крыльями. Имеет более мощный турбированный двигатель (до 10-го поколения ставился 4G63), более жесткий кузов, полный привод, механическую, автоматическую или роботизированную КПП с двумя сцеплениями. Автоматические коробки передач ставились на Evolution 7 GT-A и Evolution 9 универсал, роботизированная КПП ставится на Evolution 10."
    },
    {
      "id": 7,
      "carname": "Subaru WRX STI",
      "image": "https://i.ytimg.com/vi/wC1dOXy7Ka8/maxresdefault.jpg",
      "price": "15000",
      "description": "За всю историю Subaru выпустила 4 поколения модели Impreza. Были и седаны, и купе, и универсалы, а в третьем поколении и вовсе сначала показали хэтчбек. Но сегодня речь пойдет не о простой Impreza. Subaru выпускала еще и две заряженные версии: WRX и WRX STI. Если первая была просто со спортивным уклоном и гоночным дизайном, то вторая модификация стала самым настоящим спорткаром. Авто Информатор решил разобраться в истории этой легендарной раллийной машины."
    },
    {
      "id": 8,
      "carname": "Nissan Skyline R32",
      "image": "https://wallpaperaccess.com/full/542937.jpg",
      "price": "20000",
      "description": "Появилась в 1989 году вместе с моделью Skyline серии R32. Название GT-R было реанимировано после 16-летнего перерыва. Серийный номер кузова этой модели BNR32. Двигатель: за основу взят хорошо себя зарекомендовавший мотор серии RB, 6-цилиндровый с рядным расположением цилиндров, но его рабочий объем был доведен до 2,6 литров. Помимо этого двигатель был оснащен двумя турбинами и фронтальным интеркулером, что позволило довести его мощность до 280 лошадиных сил."
    },
    {
      "id": 9,
      "carname": "Nissan Silvia S13",
      "image": "https://wallpaperaccess.com/full/1576014.jpg",
      "price": "36000",
      "description": "Дизайн моделей Nissan второй половины 80-х годов определял стиль моделей всех японских компаний. Можно сказать, что Nissan Silvia в кузовах 13-й серии, которую начали выпускать в 1988 году, была эталоном красоты, утонченности и стиля в то время.Тогда считалось, что Honda Prelude – самая популярная модель на рынке, но компания Nissan выпустила машину, главным преимуществом которой была внешняя красота. Предполагалось, что это будет модель для молодого поколения, и она была названа «машина для свиданий».Silvia выпускалась в трех модификациях: K’s (турбовая модель), Q’s и J’s (атмосферные двигатели). На первом этапе машина комплектовалась 4-цилиндровым рядным двигателем c типом газораспределения DOHC объемом 1,8 литра – CA20, а в последующем – 4-цилиндровым рядным двигателем с типом газораспределения DOHC объемом 2 литра SR20. Большую популярность приобрела компактная спортивная модель с задним приводом."
    },
    {
      "id": 10,
      "carname": "Nissan 350z",
      "image": "https://wallpaperaccess.com/full/38761.jpg",
      "price": "27000",
      "description": "Компактный спорткар Nissan 350Z начали выпускать в Японии в 2003 году. Автомобиль продолжил серию моделей Z-серии, став преемником «Ниссана 300ZX». На локальном рынке машина, как и её предшественники, называлась Nissan Fairlady Z.Nissan 350Z, предлагавшийся как купе или родстер с тканевым складывающимся верхом, имел два места в салоне. Машина классической компоновки (двигатель спереди, привод — на задние колёса) получила многорычажные подвески всех колёс, углепластиковый карданный вал и самоблокирующийся дифференциал."
    },
    {
      "id": 11,
      "carname": "Nissan Skyline R35 ",
      "image": "https://wallpaperaccess.com/full/3705698.jpg",
      "price": "60000",
      "description": "Nissan GT-R  — спорткар, выпускаемый компанией Nissan Motor. Представлен в качестве серийной модели на Токийском автосалоне 24 октября 2007 года, продажи начались в 2008 году в Японии, затем в США и Европе. В отличие от предшественников, выпускавшихся только для JDM и ограниченным тиражом поставлявшихся в Великобританию, имеется вариант с левым рулём. Начиная с 2007 года Nissan переименовал Skyline GT-R в GT-R. Отчасти это вызвано рыночными соображениями, отчасти техническими: если вплоть до R34 Skyline GT-R был по сути усовершенствованным Skyline, то теперь GT-R представляет собой отдельную модель."
    },
    {
      "id": 12,
      "carname": "Toyota Corolla AE-86",
      "image": "https://wallpaperaccess.com/full/2326189.jpg",
      "price": "13000",
      "description": "В марте 1972 года в модельном ряду Тойота, впервые появляется спортивные модификации Toyota Corolla под именем Sprinter Trueno и Levin. По технической части автомобили были полностью идентичны. Имелись лишь незначительные внешние отличая в виде оформления передней облицовки и задних фонарей. Trueno и Levin позиционировались как спортивные модели и активно участвовали в ралли, причем с немалым успехом."
    },
    {
      "id": 13,
      "carname": "Toyota Mark-2(100)",
      "image": "https://look.com.ua/pic/201305/1920x1080/look.com.ua-68824.jpg",
      "price": "9800",
      "description": "четырёхдверный спортивный среднеразмерный седан, выпускавшийся компанией Toyota с 1968 по 2004 годы. Наименование Mark II использовалось компанией Toyota на протяжении нескольких десятилетий и первоначально использовалось в составе названия Toyota Corona Mark II. Отметка II была введена, чтобы машина выделялась из основной платформы Toyota Corona. Как только в 1970-е годы платформа была разделена, автомобиль стал известен просто как Mark II."
    },
    {
      "id": 14,
      "carname": "toyota Chaser(JSX)",
      "image": "https://wallpapercave.com/wp/wp4640073.jpg",
      "price": "7600",
      "description": "Toyota Chaser — четырёхдверный среднеразмерный седан, выпускался компанией Toyota в 1977—2001 годах. Модель спроектирована на базе Toyota Mark II. В модельном ряду Toyota занимает промежуточное место между Toyota Corona и Toyota Crown. Хотя официально данная модель продавалась только в Японии, она широко представлена на рынках подержанных автомобилей в России и Юго-Восточной Азии. Относится к одному классу вместе с Toyota Mark II и Toyota Cresta, полностью унифицирована с ними по шасси и салону. Всего выпускалось шесть поколений этой модели."
    },
    {
      "id": 15,
      "carname": "Nissan 370z",
      "image": "https://wallpaperaccess.com/full/1676229.jpg",
      "price": "45000",
      "description": " спортивный автомобиль, выпускаемый компанией Nissan Motors. В Японии серия Z известна под именем Fairlady Z. Последнее поколение представлено в качестве серийной модели в Лос-Анджелесе 19 ноября 2008 года[1], продажи стартовали в начале 2009 года. В России японский спорт-кар появился через год после дебюта на автосалоне, то есть, осенью 2009 года. В апреле 2009 года на Нью-Йоркском автосалоне состоялась мировая премьера спорт-кара Nissan 370Z в кузове родстер[2]. По данным Nissan, открытая версия спортивного купе под названием 370Z Convertible в заводской комплектации будет поставляться с мягкой тканевой крышей, а металлический вариант разработают тюнинговые компании."
    },
    {
      "id": 16,
      "carname": "Toyota Supra V",
      "image": "https://wallpaperaccess.com/full/4622528.jpg",
      "price": "60000",
      "description": "Первое заявление о пятом поколении появилось в 2014 году с концептом нового автомобиля Toyota FT-1, сильно напоминавшим дизайном Toyota Supra А80. Первые реальные прототипы были замечены в 2017 году. Автомобиль разрабатывался совместно с BMW, что очень сильно возмутило фанатов Toyota Supra. Интерьер с BMW Z4 (G29) у новой Supra один, как и сама машина и отличаются технически только кузовом, что очень сильно не понравилось фанатам бренда Toyota. Колёсная база новой Supra составляет 2468 мм. "
    },
    {
      "id": 17,
      "carname": "Honda S2000",
      "image": "https://wallpaperaccess.com/full/95832.jpg",
      "price": "120000",
      "description": "Представленный в 1995 году, на Токийском автосалоне, концепт Honda Sport Study Model (SSM) разрабатывался как серийная модель S2000. SSM был заднеприводным родстером, оснащенным 2-литровым рядным четырёхцилиндровым двигателем. Он получил жесткий каркас, позволявший повысить безопасность при столкновении. Концепт был построен с использованием алюминиевых деталей кузова и имел равное распределение массы автомобиля на обе оси."
    },
    {
      "id": 18,
      "carname": "Mitsubishi Eclipse",
      "image": "https://c4.wallpaperflare.com/wallpaper/645/735/829/power-race-car-mitsubishi-wallpaper-preview.jpg",
      "price": "54000",
      "description": "Mitsubishi Eclipse – это компактное спорткупе с посадочной формулой “2+2”, выпускающееся с 1989 года для стран с правосторонним движением включая США, Канаду и Тайвань. Автомобиль был назван в честь беговой лошади, которая в VIII веке в Британии выиграла 26 заездов и считалась непобедимой. Так же автомобиль продавался под именами Eagle Talon и Plymouth Laser в рамках тесного сотрудничества Mitsubishi Motors Company и Chrysler Corporation. Это совместное предприятие известно как Diamond-Star Motors (DSM)."
    },
    {
      "carname": "aaa",
      "price": "ihi",
      "description": "uhinkjnk",
      "image": "nnnknl",
      "id": 19
    }
  ]
}
